{"class_name": "Model", "keras_version": "2.0.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 4], "name": "dense_1_input", "sparse": false}, "inbound_nodes": [], "name": "dense_1_input"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 100, "batch_input_shape": [null, 4], "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dense_1_input", 0, 0, {}]]], "name": "dense_1"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 100, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dense_2"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_4", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 3, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dense_2", 0, 0, {}]]], "name": "dense_4"}, {"class_name": "Lambda", "config": {"function": ["c\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0006\u0000\u0000\u0000S\u0000\u0000\u0000sc\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000|\u0000\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000d\u0001\u0000f\u0002\u0000\u0019d\u0002\u0000\u0083\u0002\u0000|\u0000\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000d\u0003\u0000d\u0000\u0000\u0085\u0002\u0000f\u0002\u0000\u0019\u0017t\u0000\u0000j\u0002\u0000|\u0000\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000d\u0003\u0000d\u0000\u0000\u0085\u0002\u0000f\u0002\u0000\u0019d\u0004\u0000t\u0003\u0000\u0083\u0001\u0001\u0018S(\u0005\u0000\u0000\u0000Ni\u0000\u0000\u0000\u0000i\u00ff\u00ff\u00ff\u00ffi\u0001\u0000\u0000\u0000t\b\u0000\u0000\u0000keepdims(\u0004\u0000\u0000\u0000t\u0001\u0000\u0000\u0000Kt\u000b\u0000\u0000\u0000expand_dimst\u0004\u0000\u0000\u0000meant\u0004\u0000\u0000\u0000True(\u0001\u0000\u0000\u0000t\u0001\u0000\u0000\u0000a(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\n\u0000\u0000\u0000pdnddqn.pyt\b\u0000\u0000\u0000<lambda>7\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": [2], "output_shape_type": "raw"}, "inbound_nodes": [[["dense_4", 0, 0, {}]]], "name": "lambda_1"}], "input_layers": [["dense_1_input", 0, 0]], "output_layers": [["lambda_1", 0, 0]], "name": "model_1"}, "backend": "tensorflow"}